---
kind: property
id: P:Autodesk.Revit.DB.NumberingSchema.SchemaType
source: html/6c9d8ec5-3622-95ca-e3dc-c663f0a3b155.htm
---
# Autodesk.Revit.DB.NumberingSchema.SchemaType Property

Identifies the kind of elements/objects this numbering schema is used for.

## Syntax (C#)
```csharp
public NumberingSchemaType SchemaType { get; }
```